<template>
  <div class="items-center justify-center min-h-screen bg-white">
    <!-- Banner -->
    <div class="relative h-auto shadow-md bg-cover bg-center background-img">
      <!-- Background Overlay -->
      <div class="absolute inset-0 bg-gray-900 opacity-80"></div>

      <!-- Content Wrapper -->
      <div
        class="relative z-10 flex flex-col justify-center items-center text-center lg:py-16 py-12 px-4"
      >
        <!-- Quote -->
        <div class="fade-in">
          <p
            class="text-2xl md:text-3xl text-white font-marck italic tracking-wide mb-4"
          >
            আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি<br />
            ছেলেহারা শত মায়ের অশ্রু গড়ায়ে ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি<br />
            আমার সোনার দেশের রক্তে রাঙানো ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি।।<br />
          </p>
        </div>

        <!-- Writer's Name -->
        <!-- <div class="mt-4 flex justify-end"> -->
        <!-- Writer's Name (Slightly to the Right) -->
        <p
          class="text-md md:text-lg lg:text-xl text-gray-300 font-semibold font-marck pl-10 md:pl-16"
        >
          - আবদুল গাফফার চৌধুরী
        </p>
      </div>
    </div>
    <div class="my-8 py-8 mb-0 mx-auto max-w-screen-xl">
      <div class="bg-white text-gray-900 font-sans">
        <!-- Main Container -->
        <div class="max-w-5xl mx-auto px-4 py-12">
          <!-- Article Meta Info -->
          <div class="text-gray-600 text-sm flex justify-between items-center">
            <p>21 February 2025 • Friday</p>
          </div>

          <!-- Article Title -->
          <h1 class="text-4xl font-bold mt-2">
            আমার ভাইয়ের রক্তে রাঙ্গানো একুশে ফেব্রুয়ারি, আমি কি ভুলিতে পারি?
          </h1>

          <!-- Subtitle -->
          <!-- <p class="text-lg text-gray-700 mt-4">
                Tapping gen AI’s full potential starts by exploring what’s out
                there, then strategically linking the right solution with the right
                business opportunity or challenge now.
              </p> -->

          <!-- Authors Section -->
          <div class="flex items-center justify-between mt-6">
            <div class="flex items-center">
              <img
                src="@/assets/members/Ajna.png"
                class="rounded-full h-24 w-24 mr-3"
                alt="Author 1"
              />
              <div>
                <p class="text-lg font-semibold">Ajna Islam</p>
                <p class="text-sm text-gray-600">
                  Vice President - Artistic Engagement, B.A.N.G.L.A.
                </p>
              </div>
            </div>
          </div>

          <!-- Social Media Share Links -->
          <!-- <div class="flex items-center justify-end mt-4 space-x-4">
                <p class="text-gray-600">Share this article</p>
                <a href="#" class="text-xl text-gray-700 hover:text-gray-900">🔗</a>
                <a href="#" class="text-xl text-gray-700 hover:text-gray-900">💼</a>
                <a href="#" class="text-xl text-gray-700 hover:text-gray-900">𝕏</a>
              </div> -->

          <!-- Featured Image -->
          <!-- <div class="mt-6">
                <img
                  src="@/assets/img/culture.jpg"
                  class="w-full h-96 rounded-lg shadow-lg"
                  alt="Featured Image"
                />
              </div> -->

          <!-- Article Content -->
          <div class="mt-8">
            <div class="flex flex-col mt-8 justify-center items-center">
              <img
                src="@/assets/img/img1.png"
                class="w-80 md:w-full h-auto rounded-lg shadow-lg"
                alt="Featured Image"
              />
              <p class="text-sm mt-2 text-center">কেন্দ্রীয় শহীদ মীনার</p>
              <p class="text-sm mt-1 text-center">
                <span class="font-semibold">Photo credit: </span>Ajna Islam
              </p>
            </div>
            <p class="mt-4 text-gray-700">
              ফেব্রুয়ারির ২১ তারিখ একই সাথে মর্মান্তিক এবং গৌরবোজ্জল
              স্মৃতিবিজড়িত একটি দিন। ১৯৫২ সালের এই দিনে (৮ ফাল্গুন, ১৩৫৯) বাংলা
              কে পাকিস্তানের অন্যতম রাষ্ট্র ভাষা করার দাবিতে আন্দোলনরত ছাত্রদের
              ওপর পুলিশ গুলি বর্ষণ করলে বেশ কয়েকজন ছাত্র যুবা শহীদ হন। আর তাই এ
              দিনটি বাংলাদেশের ইতিহাসে শহীদ দিবস হিসেবে চিহ্নিত হয়ে আছে। ভোরের
              প্রথম আলোয় খালি পায়ে নীরবে হেঁটে গিয়ে শহীদ মিনারে তথা শহীদ
              বেদীতে ফুল রাখার মধ্য দিয়েই ভাষা শহীদদের প্রতি সম্মান প্রদর্শনের
              মধ্য দিয়ে বাংলাদেশের জনগণ এই চেতনা লালন করে আসছে ১৯৫৪ এর পর থেকে।
            </p>
            <h2 class="text-2xl font-bold mt-8">একুশ কি করে পেলাম?</h2>

            <p class="mt-4 text-gray-700">
              একুশ কি করে পেলাম জানতে হলে আমাদের ফিরে যেতে হবে পাকিস্তানের
              স্বাধীনতা উত্তর ৫০ এর দশকে। একুশকে বলা যায় বাঙালি জাতীয়তাবাদের
              ধারক ও বাহক। একুশ তৎকালীন পূর্ব পাকিস্তানের বাংলাভাষী জনমানুষের
              কাছে শুধুমাত্র মনের ভাব প্রকাশের দাবী ছিল না, এটা ছিল বাঙালি জাতির
              আত্মপরিচয় প্রতিষ্ঠার দাবী। ১৪ আগস্ট, ১৯৪৭ সালে ঐতিহাসিক দ্বিজাতি
              তত্ত্বের মধ্য দিয়ে জন্ম হয় পাকিস্তানের। ব্রিটিশ ভারতের পাঞ্জাব ও
              বাংলা প্রদেশ কে ভাগ করে দুটি অংশ, পূর্ব বাংলা ও পশ্চিম পাঞ্জাব,
              নিয়ে গঠিত হয় পাকিস্তান রাষ্ট্র। আর পূর্ব বাংলা হয়ে যায় পূর্ব
              পাকিস্তান। সে বছরেরই নভেম্বর মাসে পাকিস্তান সরকার উর্দুর সাথে
              ইংরেজিতে লেখা খাম, পোষ্ট কার্ড, ডাকটিকেট, রেল-টিকেট, মানি অর্ডার,
              ফর্ম ইত্যাদি ছেপে চালু করে দেয়। পাকিস্তানের কেন্দ্রীয় পাবলিক
              সার্ভিস কমিশনের তদানীন্তন সচিব গুডইন ১৯৪৭ সালের ১৫ নভেম্বর তারিখে
              বিভিন্ন বিশ্ববিদ্যালয়ে উচ্চতর সিভিল সার্ভিস পরীক্ষার বিষয়াদি
              সম্পর্কে একটি সার্কুলার প্রেরণ করেন; যেখানে ঐ পরীক্ষার জন্য
              সর্বমোট ৩১টি বিষয় দেয়া হয়, যার মধ্যে নয়টি ছিল ভাষা। এ সকল ভাষার
              মধ্যে হিন্দি, উর্দু, ইংরেজি, জার্মান, ফরাসি এমনকি ল্যাটিন ও
              সংস্কৃত স্থান পেলেও স্থান পায় না বাংলা। জাতি ধর্ম নির্বিশেষে
              বঙ্গীয় অববাহিকায় অবস্থিত এই পূর্ব পাকিস্তানের মানুষের মুখের ভাষা
              ছিল বাংলা যা তৎকালীন গোটা পাকিস্তানের সিংহ ভাগ (৬০ শতাংশ) মানুষের
              মুখের ভাষা। পাকিস্তানের একমাত্র রাষ্ট্র ভাষা উর্দু হওয়ায় পূর্ব
              পাকিস্থানের জনগণ শিক্ষা ও দৈনন্দিন কর্ম জগতে সীমাহীন অসুবিধার
              সম্মুখীন হয়ে পড়ে। ফলে বাধ্যতামূলক উর্দুর ব্যবহার বাঙালি
              পাকিস্তানীদের মধ্যে একপ্রকার চেতনার উন্মেষ ঘটায়। তাঁদের
              আত্ম-অন্বেষায় উন্মেষ ঘটে ভাষা ভিত্তিক জাতিচেতনার। জন্ম হয় ভাষা
              ভিত্তিক বাঙালি জাতীয়তাবাদের।
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৪৭ সালের শেষের দিকেই পূর্ব পাকিস্তানের রাজধানী ঢাকায় প্রথম
              বিক্ষোভ হয় পাকিস্তানের অন্যতম রাষ্ট্র ভাষা বাংলা করার জন্য।
              পাকিস্তান স্বাধীন হওয়ার মাত্র ছয় মাসের মাথায় ২৩ ফেব্রুয়ারী ১৯৪৮
              সালে করাচীতে অনুষ্ঠিত ন্যাশনাল অ্যাসেম্বলিতে সর্ব প্রথম “ উর্দু
              এবং ইংরেজির সাথে বাংলাকে গণপরিষদের কার্যধারায় অন্তর্ভুক্ত করতে
              হবে” দাবী জানানো হয়। আর পাকিস্তানের গণপরিষদ তখন পাকিস্তানের
              কেন্দ্রীয় আইনসভা হিসেবেও কাজ করছিল। যে অসীম সাহসী বাঙ্গালি এই দাবী
              উত্থাপন করেন তিনি ‘ধীরেন্দ্রনাথ দত্ত’। তিনি পাকিস্তানের
              পার্লামেন্টে দাঁড়িয়ে বলেছিলেন, “পূর্ব পাকিস্তানের ৬ কোটি ৯০ লাখ
              মানুষের মধ্যে ৪ কোটি ৪০ লাখ মানুষ বাংলায় কথা বলে, তাহলে স্যার,
              রাষ্ট্রভাষা কি হওয়া উচিত? রাষ্ট্রভাষা এমন হওয়া উচিত যেটি রাজ্যের
              সংখ্যাগরিষ্ঠ জনগণ ব্যবহার করে এবং এর জন্য, আমি মনে করি যে বাঙালি
              আমাদের রাজ্যের একটি লিঙ্গুয়া ফ্রাঙ্কা…বাংলা পাকিস্তানের অন্যতম
              রাষ্ট্রভাষা হওয়া উচিৎ”। তৎকালীন সরকার পক্ষীয় পূর্ব পাকিস্তানের
              সরকারি প্রতিনিধি লিয়াকত আলী ও খাজা নিজামুদ্দিন এই প্রস্তাবের
              বিরোধিতা করলেও পূর্ব বাংলার সাধারণ মানুষ ও ছাত্র সমাজে এর প্রভাব
              ছিল সুদূর প্রসারী।
            </p>

            <div class="flex flex-col mt-8 justify-center items-center">
              <img
                src="@/assets/img/img2.png"
                class="w-80 md:w-full h-auto rounded-lg shadow-lg"
                alt="Featured Image"
              />
              <p class="text-sm mt-2 text-center">
                ধীরেন্দ্রনাথ দত্ত আতাউর রহমান খানের মন্ত্রিসভায় মন্ত্রী হিসেবে
                শপথ নিচ্ছেন (১৯৫৭)
              </p>
              <p class="text-sm mt-1 text-center">
                <span class="font-semibold">Photo credit: </span>Ajna Islam
              </p>
            </div>

            <p class="mt-4 text-gray-700">
              ২১ মার্চ ১৯৪৮ রেসকোর্স ময়দানে মুহাম্মদ আলী জিন্নাহ এর পূর্ব
              পাকিস্তান সফর উপলক্ষে আয়োজিত একটি বিশাল সমাবেশে জিন্নাহ বলেন,
              ‘উর্দুই পাকিস্তানের রাষ্ট্রভাষা হইবে, অন্য কোনো ভাষা নহে। যে কেহ
              অন্য পথে চালিত হইবে সেই পাকিস্তানের শত্রু’। ২৪ মার্চ তারিখে কার্জন
              হলে অনুষ্ঠিত ঢাকা বিশ্ববিদ্যালয়ের সমাবর্তনে তিনি পুনরায় ঘোষণা করেন
              ‘Urdu and Urdu alone shall be the state language of Pakistan.’
              জিন্নাহ যখন বলেন, উর্দুই হবে রাষ্ট্রভাষা, তখন হলের মধ্যে বহু ছাত্র
              ‘না,না’ বলে চিৎকার করে এর প্রতিবাদ জানাতে থাকে। জিন্নাহ কঠোর ভাষায়
              তাদেরকে শাসিয়ে দেন, ‘যে কোন অসাংবিধানিক আন্দোলন কঠোর হস্তে দাবিয়ে
              রাখা হবে’। ভাষা আন্দোলনের পথিকৃৎ ধীরেন্দ্রনাথ দত্ত বিরধী দলীয়
              ডেপুটি হয়ে ১৯৪৮ সালের ৬ এপ্রিল, ইস্ট বেঙ্গল প্রভিন্সিয়াল
              অ্যাসেম্বলিতে আবারও এই প্রস্তাব উত্থাপন করেন। কিন্তু, ১৯৪৮ সালের
              পর ভাষা আন্দোলন অনেকটাই স্তিমিত হয়ে পড়ে। নীরবে চলতে থাকে বাংলাকে
              সমূলে উৎপাটনের ষড়যন্ত্র। এমনকি, ১২ ফেব্রুয়ারি, ১৯৪৯ সালে তৎকালীন
              শিক্ষা মন্ত্রী ফজলুর রহমান নিখিল পাকিস্তান শিক্ষা সম্মেলনে বাংলা
              কে আরবি হরফে লেখার প্রস্তাব করেন!
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৫০ সালের ১১ মার্চ ঢাকা বিশ্ববিদ্যালয়ের ছাত্র আব্দুল মতিনের
              নেতৃত্বে ঢাকা বিশ্ববিদ্যালয়ে গঠিত হয় ঢাকা বিশ্ববিদ্যালয়
              রাষ্ট্রভাষা সংগ্রাম কমিটি। ১৯৫২ সালে এই ভাষা আন্দোলন চরম আকার ধারণ
              করে। উর্দুকে পাকিস্তানের একমাত্র রাষ্ট্রভাষা এবং আরবি অক্ষরে বাংলা
              ভাষার প্রচলন করার বিরুদ্ধে ৪ ফেব্রুয়ারি ১৯৫২ ঢাকা বিশ্ববিদ্যালয়
              এবং শহরের সকল স্কুল কলেজের ছাত্রছাত্রীগণ ধর্মঘট পালন করে। বেলা
              ১১টা হতে শহরের বিভিন্ন স্কুল কলেজের ছাত্রছাত্রীরা শোভাযাত্রা
              সহকারে ঢাকা বিশ্ববিদ্যালয় প্রাঙ্গণে জমায়েত হোন। গাজীউল হকের
              সভাপতিত্বে বিশ্ববিদ্যালয় প্রাঙ্গণে ছাত্র ছাত্রীদের এক সভা হয়,
              যেখানে বাংলাকে রাষ্ট্র ভাষারূপে গ্রহণ করতে এবং আরবি হরফে বাংলা
              ভাষা প্রবর্তন না করতে দাবী জানানো হয়। ৫ ফেব্রুয়ারি ১৯৫২ সভা শেষে
              প্রায় দশ হাজার ছাত্র ছাত্রী এক বিরাট শোভাযাত্রা সহকারে
              বিশ্ববিদ্যালয় প্রাঙ্গণ হতে বের হয়ে প্রাদেশিক প্রধানমন্ত্রী নূরুল
              আমীনের বাসভবন হয়ে হাইকোর্টের সম্মুখ দিয়ে ছাত্রছাত্রীগণ
              ‘রাষ্ট্রভাষা বাংলা চাই’, ‘আরবি হরফে বাংলা লেখা চলবে না ’ প্রভৃতি
              স্লোগান দেয়। ২০ ফেব্রুয়ারি বুধবার ঢাকার জেলা ম্যাজিস্ট্রেট ১৪৪
              ধারার আদেশ জারী করে এক মাসের জন্য ঢাকা শহরে সভা, শোভাযাত্রা
              প্রভৃতি নিষেধ করেন।
            </p>
            <p class="mt-4 text-gray-700">
              মাতৃভাষা যে অন্যতম মৌলিক অধিকার বাঙালিরা সেটা খুব ভালো করেই তখন
              বুঝতে পেরেছিল। আর সেই অধিকার আদায়ের দাবিতে ছাত্র-জনতা ১৪৪ ধারা
              ভঙ্গ করে ২১ ফেব্রুয়ারি ঢাকা বিশ্ববিদ্যালয় প্রাঙ্গণে সমবেত হয়। বেলা
              প্রায় সাড়ে ১২টার সময় বিশ্ববিদ্যালয় প্রাঙ্গণে গাজিউল হকের
              সভাপতিত্বে সভা অনুষ্ঠিত হয়। এ সময় বিশ্ববিদ্যালয় এলাকার চতুর্দিকে
              রাইফেলধারী পুলিশ মোতায়েন ছিল। বিশ্ববিদ্যালয়ের ভিসি ও বিভাগীয়
              ডীনগণও এ সময় উপস্থিত ছিলেন। এ সময় ছাত্রনেতা আবদুস সামাদ প্রস্তাব
              করলেন, ছাত্ররা দশজন দশজন করে বের হবে। এটা এক ধরণের সত্যাগ্রহ।….
              এতে একদিকে ১৪৪ ধারা উপেক্ষা করা হবে, অপরদিকে ব্যাপক আকারের গোলযোগ
              এড়ানো সম্ভব হবে। ছাত্ররা এ প্রস্তাব শেষ পর্যন্ত মেনে নেয় এবং সঙ্গে
              সঙ্গে সভা ভঙ্গ করে দশজনী মিছিল বের করার জন্য ছাত্ররা স্লোগান দিতে
              দিতে গেটের দিকে অগ্রসর হতে থাকে। এ সময় পুলিশ বিশ্ববিদ্যালয়
              প্রাঙ্গণে কাঁদুনে গ্যাস নিক্ষেপ করার ফলে কিছু সংখ্যক ছাত্র ছুটে
              গিয়ে রাস্তার অপর পাশের ময়দানে আশ্রয় গ্রহণ করে এবং কিছু সংখ্যক
              ছাত্র দৌড়িয়ে মেডিকেল কলেজের দিকে যায়। বিশ্ববিদ্যালয় প্রাঙ্গণে
              সমবেত ছাত্ররা কাঁদুনে গ্যাস নিক্ষেপের প্রতিবাদে বিক্ষোভ প্রদর্শন
              করে। এ সময় ভিসি পুলিশের নিকট বিশ্ববিদ্যালয়ের প্রাঙ্গণে কাঁদুনে
              গ্যাস নিক্ষেপের প্রতিবাদ জানালেও ১৪৪ ধারা অমান্য করা হয়েছে বলে
              পুলিশ অনেক ছাত্রকে গ্রেফতার করে এবং বহু ছাত্রকে মোটরে করে সুদূর
              তেজগাঁও নিয়ে ছেড়ে দেয়। ৬২ জনকে পুলিশ গ্রেফতার করে ঢাকা সেন্ট্রাল
              জেলে আটকে রাখলে ছাত্র মহলে দারুণ উত্তেজনার সৃষ্টি হয়।
            </p>
            <p class="mt-4 text-gray-700">
              এ দিকে ঢাকা মেডিকেল কলেজের সামনে সমাবেশের প্রস্তুতি চলছিল। বেলা
              আনুমানিক ২টার সময় পরিষদের সদস্যগণ পরিষদ অভিমুখে গমনকালে ছাত্ররা
              পথরোধ করে পরিষদে রাষ্ট্রভাষা সম্পর্কে আলোচনা করার ও পুলিশী জুলুমের
              বিরুদ্ধে প্রতিবাদ জানানোর জন্য অনুরোধ জানায়। পুলিশ জনতাকে চলে যেতে
              বললে তারা অস্বীকার করে। এরপর পুলিশ কাঁদুনে গ্যাস নিক্ষেপ ও
              লাঠিচার্জ করতে করতে মেডিকেল কলেজ হোস্টেলের ভেতরে ঢুকে পড়ে। হোস্টেল
              প্রাঙ্গণে ঢুকে ছাত্রদের উপর আক্রমণ করায় ছাত্ররা ইট পাটকেল ছুঁড়ে
              আত্মরক্ষার্ চেষ্টা করে । পুলিশ তখন ছাত্রদের দিকে লক্ষ্য করে গুলি
              চালায়। ঘটনাস্থলেই আবদুল জব্বার ও রফিকউদ্দিন আহমদ, আব্দুস সালাম,
              আবুল বরকত সহ এগারো জন শহীদ হন এবং আরও ১৭ জনের মতো আহত হন।
            </p>
            <p class="mt-4 text-gray-700">
              এ ঘটনার প্রতিবাদে ক্ষুব্ধ ঢাকাবাসী ঢাকা মেডিকেল কলেজ হোস্টেলে
              সমবেত হয়। নানা নির্যাতন সত্ত্বেও ছাত্রদের পাশাপাশি সাধারণ মানুষ
              প্রতিবাদ জানাতে পরের দিন ২২ ফেব্রুয়ারি পুনরায় রাজপথে নেমে আসে।
              তারা মেডিকেল কলেজ হোস্টেল প্রাঙ্গণে শহীদদের জন্য অনুষ্ঠিত গায়েবি
              জানাজায় অংশগ্রহণ করে। ভাষাশহীদদের স্মৃতিকে অমর করে রাখার জন্য ২৩
              ফেব্রুয়ারি এক রাতের মধ্যে মেডিকেল কলেজ হোস্টেল প্রাঙ্গণে গড়ে ওঠে
              একটি স্মৃতিস্তম্ভ, যা সরকার ২৬ ফেব্রুয়ারি গুঁড়িয়ে দেয়, যেখানে
              বর্তমানে কেন্দ্রীয় শহীদ মীনার রয়েছে। ইতোমধ্যে সারাদেশে ভাষা
              আন্দোলন ছড়িয়ে পড়ে। সরকার সর্বত ভাবে এই আন্দোলনকে অবদমন করার
              চেষ্টা করে।
            </p>
            <div class="flex flex-col mt-8 justify-center items-center">
              <img
                src="@/assets/img/img3.png"
                class="w-80 md:w-full h-auto rounded-lg shadow-lg"
                alt="Featured Image"
              />

              <p class="text-sm mt-1 text-center">
                <span class="font-semibold">Photo credit: </span>Ajna Islam
              </p>
            </div>

            <p class="mt-4 text-gray-700">
              ১৯৫৪ সালে প্রাদেশিক পরিষদ নির্বাচনে যুক্তফ্রন্ট জয়লাভ করলে ৭ মে
              ১৯৫৪ সালে মুসলিম লীগের সমর্থনে বাংলাকে রাষ্ট্রভাষার মর্যাদা দেয়া
              হয়। বাংলাকে পাকিস্তানের দ্বিতীয় রাষ্ট্রভাষা হিসাবে স্বীকৃতি দিয়ে
              সংবিধানে পরিবর্তন আনা হয় ২৯ ফেব্রুয়ারি ১৯৫৬ সালে। সংবিধানের ২১৪(১)
              অধ্যায়ে রাষ্ট্রভাষা সম্পর্কে লেখা হয়: ‘২১৪.(১) ‘The state language
              of Pakistan shall be Urdu and Bengali’ অর্থাৎ উর্দু এবং বাংলা হবে
              পাকিস্তানের রাষ্ট্রভাষা।
            </p>
            <p class="mt-4 text-gray-700">
              আর তখন থেকে প্রতি বছর এ দিনটি জাতীয় ‘শহীদ দিবস’ হিসেবে উদযাপিত
              হয়ে আসছে। পাকিস্তান সরকার রাষ্ট্র ভাষার দাবি মেনে নিতে বাধ্য হয়।
              এ দিন যে শুধুমাত্র বাংলা ভাষার জয় হয়েছিল তা নয়। এর মধ্য দিয়ে
              জয় হয়েছিল বাঙালি জাতীয়তাবাদের, ভাষার ভিত্তিতে বাঙালি স্বীকৃতি
              আদায় করে নেয় তার বাঙালি জাতি পরিচয়ের। বলাবাহুল্য, এই ভাষা
              আন্দোলনের মধ্য দিয়েই ভবিষ্যৎ মুক্তিযুদ্ধের বীজ বপন হয়েছিল।
            </p>
            <h2 class="text-2xl font-bold mt-8">একুশের উদযাপনঃ</h2>
            <div class="flex flex-col mt-8 justify-center items-center">
              <img
                src="@/assets/img/img4.png"
                class="w-80 md:w-full h-auto rounded-lg shadow-lg"
                alt="Featured Image"
              />

              <p class="text-sm mt-1 text-center">
                <span class="font-semibold">Photo credit: </span>Ajna Islam
              </p>
            </div>
            <p class="mt-4 text-gray-700">
              পলাশ রাঙা রক্তের দাগকে স্মরণ রাখতে, ভাষা সৈনিকদের সম্মান জানাতে,
              আর বাঙালির জাতীয়তাবাদের চেতনাকে জাগ্রত রাখতে ফেব্রুয়ারির ২১ তারিখ
              পালিত হয় ‘শহীদ দিবস’ এবং ‘মাতৃভাষা দিবস’ হিসেবে ।
            </p>
            <p class="mt-4 text-gray-700">
              ৯০ এর দশকে, যখন ছোট ছিলাম ২০ ফেব্রুয়ারি ছিল একটা দারুন উত্তেজনার
              রাত। ফাগুনের এই মাঝ রাতে মানুষের বাগানের ফুল আর পাতাবাহার গাছের
              পাতা রীতিমত লুট করা হত দলবদ্ধ ভাবে । প্রত্যেকের বাড়ির বাগানের ফুল
              গাছ রাত জেগে পাহারা দেয়া হত চুরি হয়ে যাওয়ার ভয়ে। আমরা ছোটরা আগের
              দিন সন্ধ্যাায় পাতাবাহার গাছ থেকে রং-বেরঙ্গের বড় বড় পাতা, নানা রঙের
              ফুল সংগ্রহ করে গ্লাসে বাটিতে ভিজিয়ে রাখতাম। অনেক রাত জেগে আম্মা
              এবং বড় ভাই বোনেরা সবাই মিলে ফুলের তোড়া বানিয়ে দিত। কালো রঙের শাড়ি,
              জামা এগুলো প্রস্তুত করে রাখতাম আমরা। টান টান উত্তেজনা নিয়ে ২১
              ফেব্রুয়ারি ভোর বেলায়, অন্ধকার থাকতে থাকতে আমরা ছোটরা কালো রঙের
              জামা, বড় বোনেরা কালো পাড় সাদা শাড়ি পরে, খালি পায়ে শহীদ মিনারের
              উদ্দেশ্যে যাত্রা করতাম। টেলিভিশনে সরাসরি সম্প্রচারিত হত কেন্দ্রীয়
              শহীদ মিনারে রাষ্ট্রপতি ও প্রধানমন্ত্রীর পুষ্পস্তবক অর্পণের দৃশ্য।
              কত কবিতা পাঠ আর করুণ সুরে গাওয়া হত ‘আমার ভাই এ রক্তে রাঙানো ২১
              ফেব্রুয়ারি গান।‘ এদিন যেমন অনেক রাত পর্যন্ত সবাই জেগে থাকতাম, আবার
              কাক ভোরে আম্মা ডেকে দিত শহীদ মিনারে যাওয়ার জন্য। আমাদের নরসিংদী
              কলেজ প্রাঙ্গনে সকালবেলা অনুষ্ঠিত হত সাংস্কৃতিক অনুষ্ঠান। একদিকে
              শহীদ মিনারে সবাই ফুল দিচ্ছে আরেক দিকে চলছে দেশাত্ববোধক, পল্লীগীতি
              ও বাউল গান। শিল্পকলা , শিশু একাডেমী গুলো তে হত ২১ ফেব্রুয়ারির উপর
              রচনা, অভিনয়, কবিতা আবৃত্তি, গান ও নাচের প্রতিযোগিতা। ২১ পালিত হত
              ভাষা চর্চাকে আরও উৎসাহিত করার মধ্য দিয়ে এবং ভাষা শহীদদের আত্মত্যাগ
              স্মরনের মধ্য দিয়ে। মসজিদের হুজুরদের ফাঁকি দিয়ে শহীদ মিনারে ফুল
              দিতে যাওয়া ছিল অন্য রকম এক রোমাঞ্চ। পাড়ার হুজুরেরা ফুল দেয়া পাপ,
              শহীদ মিনারে ফুল দিলে শাস্তি দেয়ার হুমকি দিলেও ২১ এর সকালে শহীদ
              মিনারে ফুল দেয়ার উন্মাদনাকে চাপা দিতে পারত না। অনেকে মজা করে
              বিভিন্ন শাকসব্জি দিয়ে তোড়া বানিয়ে এনেও একুশ উজ্জাপনে রস সঞ্চার
              করতো। শোক আনন্দ মিলে মিশে যেন একাকার। ঢাকা বিশ্ববিদ্যালয়ে অধ্যয়নের
              সময় সুযোগ হয় কেন্দ্রীয় শহীদ মিনাররে ২১ ফেব্রুয়ারি উজ্জাপনের। অতি
              যতনে, নিরাপত্তার ভেতর দিয়ে ২১ এর আয়োজন। সারা ঢাকা শহর ও তার
              আশেপাশের মানুষ ভর তিনটা থেকে লাইন ধরে দাঁড়িয়ে থেকে শহীদ বেদীতে
              শ্রদ্ধা নিবেদন করে। এ অনন্য এক অভিজ্ঞতা।
            </p>
            <p class="mt-4 text-gray-700">
              ঢাকা বিশ্ববিদ্যালয়ের পরিচালনায় ২১ ফেব্রুয়ারি রাত ১২টা এক মিনিটে
              প্রথমে রাষ্ট্রপতি এবং পরে একাদিক্রমে প্রধানমন্ত্রী, মন্ত্রীপরিষদের
              সদস্যবৃন্দ, ঢাকা বিশ্ববিদ্যালয়ের উপাচার্য, শিক্ষকবৃন্দ, ঢাকাস্থ
              বিভিন্ন দূতাবাসের কর্মকর্তাবৃন্দ, রাজনৈতিক নেতৃবৃন্দ, বিভিন্ন
              প্রতিষ্ঠান ও সংগঠন এবং সর্বস্তরের জনগণ কেন্দ্রীয় শহীদ মিনার-এ এসে
              শহীদদের প্রতি শ্রদ্ধার্ঘ্য নিবেদন করেন। এ সময় ‘আমার ভাইয়ের রক্তে
              রাঙানো একুশে ফেব্রুয়ারি, আমি কি ভুলিতে পারি’ গানের করুণ সুর বাজতে
              থাকে। এ দিন সকলে শোকের প্রতীক কালো ও সাদা রঙের কাপড় পরিধান করে ।
              বাংলাদেশ স্বাধীন হওয়ার পর ২১ ফেব্রুয়ারি সরকারি ছুটির দিন হিসেবে
              ঘোষিত হয়।
            </p>
            <h2 class="text-2xl font-bold mt-8">
              একুশ দেশের গণ্ডি পেড়িয়ে সবারঃ
            </h2>
            <p class="mt-4 text-gray-700">
              ১৯৫২ সালের একুশে ফেব্রুয়ারি যে চেতনায় উদ্দীপিত হয়ে বাঙালিরা
              রক্ত দিয়ে মাতৃভাষাকে মর্যাদার আসনে প্রতিষ্ঠিত করেছিল, তা আজ
              আন্তর্জাতিক সম্প্রদায়ের স্বীকৃতি লাভ করেছে। ১৯৯৯ সালের ১৭ নভেম্বর
              অনুষ্ঠিত ইউনেস্কোর প্যারিস অধিবেশনে একুশে ফেব্রুয়ারিকে
              ‘আন্তর্জাতিক মাতৃভাষা দিবস’ হিসেবে ঘোষণা করা হয় এবং ২০০০ সালের ২১
              ফেব্রুয়ারি থেকে দিবসটি জাতিসঙ্ঘের সদস্যদেশসমূহে যথাযথ মর্যাদায়
              পালিত হচ্ছে। ইতিহাসে কোন জাতি ভাষার দাবিতে প্রাণ দেয়ার নজির এটাই
              ছিল প্রথম। জনসংখ্যার দিক থেকে বাংলা বিশ্বে চতুর্থ বৃহত্তম ভাষা।
              আন্তর্জাতিক মাতৃভাষা দিবস হওয়ায় একুশ বিশ্বে মাতৃভাষা ধরে রাখার
              গুরুত্বকে আরও জোরদার করেছে।
            </p>

            <p class="mt-4 text-gray-700">
              কানাডার ভ্যাঙ্কুভার শহরে বসবাসরত দুই বাঙালি রফিকুল ইসলাম এবং
              আব্দুস সালাম প্রাথমিক উদ্যোক্তা হিসেবে একুশে ফেব্রুয়ারিকে
              ‘আন্তর্জাতিক মাতৃভাষা দিবস’ হিসেবে ঘোষণার আবেদন জানিয়েছিলেন
              জাতিসংঘের মহাসচিব কফি আনানের কাছে ১৯৯৮ খ্রিষ্টাব্দে। সে সময়
              সেক্রেটারী জেনারেলের প্রধান তথ্য কর্মচারী হিসেবে কর্মরত হাসান
              ফেরদৌসের নজরে এ চিঠিটি আসে। তিনি ১৯৯৮ সালের ২০ শে জানুয়ারী রফিককে
              অনুরোধ করেন তিনি যেন জাতিসংঘের অন্য কোন সদস্য রাষ্ট্রের কারো কাছ
              থেকে একই ধরনের প্রস্তাব আনার ব্যবস্থা করেন। পরে রফিক, আব্দুস
              সালামকে সাথে নিয়ে “মাদার ল্যাংগুয়েজ লাভার্স অফ দ্যা ওয়ার্ল্ড”
              নামে একটি সংগঠন দাঁড় করান। এতে একজন ইংরেজিভাষী, একজন জার্মানভাষী,
              একজন ক্যান্টোনিভাষী, একজন কাচ্চিভাষী সদস্য ছিলেন। তারা আবারো কফি
              আনানকে “এ গ্রুপ অব মাদার ল্যাংগুয়েজ অফ দ্যা ওয়ার্ল্ড”-এর পক্ষ
              থেকে একটি চিঠি লেখেন ।
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৯৯ খ্রিষ্টাব্দের ১৭ নভেম্বর অনুষ্ঠিত ইউনেস্কোর প্যারিস অধিবেশনে
              এ প্রস্তাব উত্থাপন করা হলে, এতে ১৮৮টি দেশ সমর্থন জানালে একুশে
              ফেব্রুয়ারিকে ‘আন্তর্জাতিক মাতৃভাষা দিবস’ হিসেবে ঘোষণা করা হয় এবং
              ২০০০ সালের ২১ ফেব্রুয়ারি থেকে দিবসটি জাতিসংঘের সদস্য দেশসমূহে
              যথাযথ মর্যাদায় পালিত হয়ে আসছে।
            </p>
            <p class="mt-4 text-gray-700">
              পরিশেষে বলতে চাই, চর্চায় যেমন ভাষা প্রাণ পায়, তেমনই চর্চার অভাবে
              ভাষা আবার মৃত্যুর দিকে ধাবিত হয়। বিশ্বায়নের এই যুগে, মানুষ কর্ম
              সূত্রে ছড়িয়ে পড়ছে পৃথিবীর এক প্রান্ত থেকে অপর প্রান্তে, চর্চার
              অভাবে বিলুপ্ত হয়ে যাচ্ছে বিভিন্ন জনগোষ্ঠীর আদি ভাষা। একটি
              সাংবিধানিক ভাষার আধিপত্য়ে হারিয়ে যাচ্ছে ছোট ছোট নৃগোষ্ঠীর, এবং
              আদিবাসীদের ভাষা। বাংলাদেশেও দেখা যায় আদিবাসীদের ভাষা প্রায়
              বিলুপ্তির পথে। একুশ আমাদের মনে করিয়ে দেয় আমাদের ভাষা আমাদের মৌলিক
              অধিকার, ভাষা আমাদের স্বতন্ত্র পরিচায়ক। একুশ আমাদের দেয় ভাষা
              ভিত্তিক ঔপনিবেশিকতার শেকল ভেঙ্গে মাতৃভাষাকে লালন করার চেতনা, মাথা
              নত না করার সাহস। এমনি করে একুশ আসুক, অমর একুশ বেঁচে থাকুক আমাদের
              চেতনায়…
            </p>
            <div class="references mt-12">
              <p class="text-gray-700">
                তথ্যসূত্রঃ বাংলাপিডিয়া, উইকিপিডিয়া,
                <a
                  href="https://liberationwarbangladesh.org/?p=9394"
                  target="_blank"
                  class="text-blue-600 hover:underline"
                >
                  liberationwarbangladesh.org </a
                >,
                <a
                  href="https://www.thedailystar.net/views/in-focus/news/dhirendranath-dutta-portrait-patriot-2224291"
                  target="_blank"
                  class="text-blue-600 hover:underline"
                >
                  The Daily Star
                </a>
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      class="relative px-2 bg-gradient-to-r from-amber-50 to-blue-50 bg-img bg-cover bg-center h-96 group pt-8"
    >
      <!-- Overlay for Background Image -->
      <div class="absolute inset-0 bg-gray-900 opacity-85"></div>

      <!-- Tooltip for Image Credit -->
      <div
        class="absolute bottom-2 left-1/2 transform -translate-x-1/2 bg-black text-white text-xs px-2 py-1 rounded opacity-0 group-hover:opacity-100 transition-opacity duration-300"
      >
        Background Image by:
        <a
          class="hover:underline"
          href="https://ca.pinterest.com/pin/2251868554953302/"
          >https://ca.pinterest.com/pin/2251868554953302/</a
        >
        <div
          class="absolute left-1/2 transform -translate-x-1/2 top-full w-0 h-0 border-l-4 border-r-4 border-t-4 border-l-transparent border-r-transparent border-t-black"
        ></div>
      </div>

      <!-- Content Overlay -->
      <div
        class="container md:mx-auto py-6 px-4 space-y-3 lg:px-32 relative z-10"
      >
        <h2
          class="text-4xl md:text-5xl font-bold mb-2 text-white font-cormorant pt-6"
        >
          Join Our Network
        </h2>
        <p class="text-white text-lg text-justify my-2 mb-6">
          Join - Bangali Abhibasi Network: a Glocal Linguo-cultural Association
        </p>
        <button
          @click="join"
          aria-label="Contribute to the community"
          class="text-base px-4 py-3 border-2 border-yellow-500 bg-gradient-to-r from-yellow-500 to-yellow-600 text-white font-semibold rounded-lg lg:hover:bg-gradient-to-r lg:hover:from-gray-50 lg:hover:to-white lg:hover:border-honey-gold lg:hover:border-2 lg:hover:text-honey-gold transition duration-300 ease-in-out"
        >
          Join Our Network
        </button>
      </div>
    </div>
  </div>
</template>

<script>
import CookieConsent from "../../components/CookieConsent.vue";

export default {
  name: "amar-vaiyer-rokte-rangano-ekushe-february",
  components: {
    CookieConsent,
  },

  data() {
    return {};
  },
  methods: {
    join() {
      this.$router.push("/contribute/membership");
    },
  },
};
</script>

<style scoped>
.img {
  background-image: url("@/assets/img/21feb.jpeg");
  background-size: cover;
  background-position: center;
}
.background-img {
  background-image: url("@/assets/img/211.jpg");
}
.fade-in {
  animation: fadeIn 2s ease-in-out;
}
.bg-img {
  background-image: url("@/assets/img/bg-contribute.png");
}
</style>
