<template>
  <div class="items-center justify-center min-h-screen bg-white">
    <!-- Banner -->
    <div class="relative h-auto shadow-md bg-cover bg-center background-img">
      <!-- Background Overlay -->
      <div class="absolute inset-0 bg-gray-900 opacity-80"></div>

      <!-- Content Wrapper -->
      <div
        class="relative z-10 flex flex-col justify-center items-center text-center lg:py-16 py-12 px-4"
      >
        <!-- Quote -->
        <div class="fade-in">
          <p
            class="text-2xl md:text-3xl text-white font-marck italic tracking-wide mb-4"
          >
            আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি<br />
            ছেলেহারা শত মায়ের অশ্রু গড়ায়ে ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি<br />
            আমার সোনার দেশের রক্তে রাঙানো ফেব্রুয়ারি<br />
            আমি কি ভুলিতে পারি।।<br />
          </p>
        </div>

        <!-- Writer's Name -->
        <!-- <div class="mt-4 flex justify-end"> -->
        <!-- Writer's Name (Slightly to the Right) -->
        <p
          class="text-md md:text-lg lg:text-xl text-gray-300 font-semibold font-marck pl-10 md:pl-16"
        >
          - আবদুল গাফফার চৌধুরী
        </p>
      </div>
    </div>
    <div class="my-8 py-8 mb-0 mx-auto max-w-screen-xl">
      <div class="bg-white text-gray-900 font-sans">
        <!-- Main Container -->
        <div class="max-w-5xl mx-auto px-4 py-12">
          <!-- Article Meta Info -->
          <div class="text-gray-600 text-sm flex justify-between items-center">
            <p>21 February 2025 • Friday</p>
          </div>

          <!-- Article Title -->
          <h1 class="text-4xl font-bold mt-2">
            আমার ভাইয়ের রক্তে রাঙ্গানো একুশে ফেব্রুয়ারি,  আমি কি ভুলিতে পারি?
          </h1>

          <!-- Subtitle -->
          <!-- <p class="text-lg text-gray-700 mt-4">
            Tapping gen AI’s full potential starts by exploring what’s out
            there, then strategically linking the right solution with the right
            business opportunity or challenge now.
          </p> -->

          <!-- Authors Section -->
          <div class="flex items-center justify-between mt-6">
            <div class="flex items-center">
              <img
                src="@/assets/members/AjnaIslam.jpeg"
                class="rounded-full h-24 w-24 mr-3"
                alt="Author 1"
              />
              <div>
                <p class="text-lg font-semibold">Ajna Islam</p>
                <p class="text-sm text-gray-600">
                  Vice President - Artistic Engagement, B.A.N.G.L.A
                </p>
              </div>
            </div>
          </div>

          <!-- Social Media Share Links -->
          <!-- <div class="flex items-center justify-end mt-4 space-x-4">
            <p class="text-gray-600">Share this article</p>
            <a href="#" class="text-xl text-gray-700 hover:text-gray-900">🔗</a>
            <a href="#" class="text-xl text-gray-700 hover:text-gray-900">💼</a>
            <a href="#" class="text-xl text-gray-700 hover:text-gray-900">𝕏</a>
          </div> -->

          <!-- Featured Image -->
          <!-- <div class="mt-6">
            <img
              src="@/assets/img/culture.jpg"
              class="w-full h-96 rounded-lg shadow-lg"
              alt="Featured Image"
            />
          </div> -->

          <!-- Article Content -->
          <div class="mt-8">
            <p class="mt-4 text-gray-700">
              ফেব্রুয়ারির ২১ তারিখ একি সাথে মর্মান্তিক এবং গৌরবোজ্জল
              স্মৃতিবিজড়িত একটি দিন। ১৯৫২ সালের এই দিনে (৮ ফাল্গুন, ১৩৫৯) বাংলা
              কে পাকিস্থানের অন্যতম রাষ্ট্র ভাষা করার দাবিতে আন্দোলনরত ছাত্রদের
              ওপর পুলিশ গুলি বর্ষণ করলে বেশ কয়েকজন ছাত্র যুবা শহীদ হন। আর তাই এ
              দিন টি বাংলাদেশের ইতিহাসে শহীদ দিবস হিসেবে চিহ্নিত হয়ে আছে। ভোরের
              প্রথম আলোয় খালি পায়ে নীরবে হেঁটে গিয়ে শহীদ মিনারে তথা শহীদ
              বেদীতে ফুল রাখার মধ্য দিয়েই ভাষা শহীদদের প্রতি সম্মান প্রদর্শনের
              মধ্য দিয়ে বাংলাদেশের জনগণ এই চেতনার লালন করে আসছে ৫৪ এর পর থেকে।
            </p>

            <h2 class="text-2xl font-bold mt-8">#একুশ কি করে পেলাম?</h2>

            <p class="mt-4 text-gray-700">
              একুশকে বলা যায় বাঙালি জাতীয়তাবাদের ধারক ও বাহক। একুশ তৎকালীন
              পূর্ব পাকিস্তানের বাংলাভাষী জনমানুষের শুধুমাত্র মনের ভাব প্রকাশের
              দাবী ছিল না, এটা ছিল বাঙালি জাতির আত্মপরিচয় প্রতিষ্ঠার দাবী। ১৯৪৭
              সালে ঐতিহাসিক দ্বী-জাতি তত্ত্বের মধ্য দিয়ে জন্ম হয় ভারত ও
              পাকিস্থানের। পূর্ব বাংলা ও পশ্চিম পাকিস্থান নিয়ে গঠিত হয় পাকিস্থান
              রাষ্ট্র। পূর্ব বাংলা হয়ে যায় পূর্ব পাকিস্থান। জাতি ধর্ম নির্বিশেষে
              বঙ্গীয় আববাহিকায় অবস্থিত এই পূর্ব পাকিস্থানের মানুষের একমাত্র
              মুখের ভাষা ছিল বাংলা যা তৎকালীন গোটা পাকিস্তানের সিংহ ভাগ(৬০
              শতাংশ) মানুষের মুখের ভাষা। পাকিস্থানের একমাত্র রাষ্ট্র ভাষা উর্দু
              হওয়ায় পূর্ব পাকিস্থানের জনগণ শিক্ষা ও কর্ম জগতে আত্যন্ত অসুবিধার
              সম্মুখীন হয়ে পড়ে। ফলে বাধ্যতামূলক উর্দুর ব্যবহার বাঙালি
              পাকিস্তানীদের মধ্যে একপ্রকার চেতনার উন্মেষ ঘটায়। তাঁদের
              আত্ম-অন্বেষায় উন্মেষ ঘটে ভাষা ভিত্তিক জাতিচেতনার। জন্ম হয় ভাষা
              ভিত্তিক বাঙালি জাতীয়তাবাদের। এর পথ ধরেই ১৯৪৭ সালের শেষের দিকে
              পূর্ব পাকিস্থানের রাজধানী ঢাকায় প্রথম বিক্ষোভ হয় পাকিস্তানের
              অন্যতম রাষ্ট্র ভাষা বাংলা করার জন্য। ১৯৫২ সালে এই ভাষা আন্দোলন চরম
              আকার ধারণ করে। পাকিস্তানের প্রতিষ্ঠাতা মোহাম্মদ আলী জিন্নাহ্ পূর্ব
              পাকিস্তান সফরে এসে ঢাকা বিশ্ববিদ্যালয়ে ঘোষণা করলেন পাকিস্তানের
              একমাত্র রাষ্ট্রভাষা হবে উর্দু, উপস্থিত ছাত্রজনতা এর প্রতিবাদ
              তাৎক্ষণিক জানিয়েছিল 'রাষ্ট্র ভাষা বাংলা চাই' স্লোগান দিয়ে।
            </p>
            <p class="mt-4 text-gray-700">
              মাতৃভাষা যে অন্যতম মৌলিক অধিকার বাঙালিরা সেটা খুব ভালো করেই তখন
              বুঝতে পেরেছিল। আর সেই অধিকার আদায়ের দাবিতে ছাত্র-জনতা ১৯৫২ সালের
              ২১ তারিখ ১৪৪ ধারা ভঙ্গ করে ঢাকা মেডিক্যাল কলেজের সামনে আমতলা থেকে
              মিছিল বের করে। কিছুদূর যেতে না যেতেই পুলিশ মিছিলের গুলিবর্ষণ করে
              এতে রফিক, আব্দুস সালাম, আবুল বরকত, আব্দুল জব্বার সহ এগারো জন নিহত
              হন এবং অনেকে আহত হন। এ ঘটনার প্রতিবাদে ক্ষুব্ধ ঢাকাবাসী ঢাকা
              মেডিকেল কলেজ হোস্টেলে সমবেত হয়। নানা নির্যাতন সত্ত্বেও ছাত্রদের
              পাশাপাশি সাধারণ মানুষ প্রতিবাদ জানাতে পরের দিন ২২ ফেব্রুয়ারি
              পুনরায় রাজপথে নেমে আসে। তারা মেডিকেল কলেজ হোস্টেল প্রাঙ্গণে
              শহীদদের জন্য অনুষ্ঠিত গায়েবি জানাজায় অংশগ্রহণ করে। ভাষাশহীদদের
              স্মৃতিকে অমর করে রাখার জন্য ২৩ ফেব্রুয়ারি এক রাতের মধ্যে মেডিকেল
              কলেজ হোস্টেল প্রাঙ্গণে গড়ে ওঠে একটি স্মৃতিস্তম্ভ, যা সরকার ২৬
              ফেব্রুয়ারি গুঁড়িয়ে দেয়। ইতোমধ্যে সারাদেশে ভাষা আন্দোলন ছড়িয়ে
              পড়ে।
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৫৪ সালে প্রাদেশিক পরিষদ নির্বাচনে যুক্তফ্রন্ট জয়লাভ করলে ৯ মে
              অনুষ্ঠিত গণপরিষদের অধিবেশনে বাংলাকে পাকিস্তানের অন্যতম রাষ্ট্রভাষা
              হিসেবে স্বীকৃতি দেওয়া হয়। তখন থেকে প্রতি বছর এ দিনটি জাতীয় ‘শোক
              দিবস’ হিসেবে উদ্যাপিত হয়ে আসছে। পাকিস্থান সরকার রাষ্ট্র ভাষার
              দাবি মেনে নিতে বাধ্য হয়। এ দিন যে শুধুমাত্র বাংলাভাষার জয় হয়েছিল
              তা নয়। এর মধ্য দিয়ে জয় হয়েছিল বাঙালি জাতীয়তাবাদের, ভাষার
              ভিত্তিতে বাঙালি স্বীকৃতি আদায় করে নেয় তার বাঙালি জাতি পরিচয়ের।
            </p>
            <h2 class="text-2xl font-bold mt-8">#একুশের উদযাপনঃ</h2>

            <p class="mt-4 text-gray-700">
              পলাশ রাঙা রক্তের দাগ কে স্মরণ রাখতে, ভাষা সৈনিকদের সম্মান জানাতে,
              আর বাঙালির জাতীয়তাবাদের চেতনাকে জাগ্রত রাখতে ফেব্রুয়ারির ২১ তারিখ
              পালিত হয় শোক দিবস এবং ভাষা দিবস হিসেবে । বর্তমানে ঢাকা
              বিশ্ববিদ্যালয়ের পরিচালনায় ২১ ফেব্রুয়ারি রাত ১২টা এক মিনিটে
              প্রথমে রাষ্ট্রপতি এবং পরে একাদিক্রমে প্রধানমন্ত্রী, মন্ত্রিপরিষদের
              সদস্যবৃন্দ, ঢাকা বিশ্ববিদ্যালয়ের উপাচার্য, শিক্ষকবৃন্দ, ঢাকাস্থ
              বিভিন্ন দূতাবাসের কর্মকর্তাবৃন্দ, রাজনৈতিক নেতৃবৃন্দ, বিভিন্ন
              প্রতিষ্ঠান ও সংগঠন এবং সর্বস্তরের জনগণ কেন্দ্রীয় শহীদ মিনার-এ এসে
              শহীদদের প্রতি শ্রদ্ধার্ঘ্য নিবেদন করেন। এ সময় ‘আমার ভাইয়ের রক্তে
              রাঙানো একুশে ফেব্রুয়ারি, আমি কি ভুলিতে পারি’ গানের করুণ সুর বাজতে
              থাকে। এ দিন সকলে শোকের প্রতীক কালো ও সাদা রঙের কাপড় পরিধান করে ।
              বাংলাদেশ স্বাধীন হওয়ার পর ২১ ফেব্রুয়ারি সরকারি ছুটির দিন হিসেবে
              ঘোষিত হয়।
            </p>
            <h2 class="text-2xl font-bold mt-8">
              #একুশ দেশের গণ্ডি পেড়িয়ে সবারঃ
            </h2>
            <p class="mt-4 text-gray-700">
              ১৯৫২ সালের একুশে ফেব্রুয়ারি যে চেতনায় উদ্দীপিত হয়ে বাঙালিরা
              রক্ত দিয়ে মাতৃভাষাকে মর্যাদার আসনে প্রতিষ্ঠিত করেছিল, আজ তা আজ
              আন্তর্জাতিক সম্প্রদায়ের স্বীকৃতি লাভ করেছে। ১৯৯৯ সালের ১৭ নভেম্বর
              অনুষ্ঠিত ইউনেস্কোর প্যারিস অধিবেশনে একুশে ফেব্রুয়ারিকে
              ‘আন্তর্জাতিক মাতৃভাষা দিবস’ হিসেবে ঘোষণা করা হয় এবং ২০০০ সালের ২১
              ফেব্রুয়ারি থেকে দিবসটি জাতিসঙ্ঘের সদস্যদেশসমূহে যথাযথ মর্যাদায়
              পালিত হচ্ছে। ইতিহাসে কোন দেশ ভাষার দাবিতে প্রাণ দেয়ার নজির এটাই
              ছিল। জনসংখ্যার দিক থেকে বাংলা বিশ্বে তৃতীয় বৃহত্তম ভাষা।
              আন্তর্জাতিক মাতৃভাষা দিবস হওয়ায় একুশ বিশ্ব ইতিহাস মাতৃভাষা ধরে
              রাখার গুরুত্বকে আরও জোরদার করেছে।
            </p>
            <p class="mt-4 text-gray-700">
              কানাডার ভ্যাঙ্কুভার শহরে বসবাসরত দুই বাঙালি রফিকুল ইসলাম এবং
              আব্দুস সালাম প্রাথমিক উদ্যোক্তা হিসেবে একুশে ফেব্রুয়ারিকে
              আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণার আবেদন জানিয়েছিলেন
              জাতিসংঘের মহাসচিব কফি আনানের কাছে ১৯৯৮ খ্রিষ্টাব্দে। সে সময়
              সেক্রেটারী জেনারেলের প্রধান তথ্য কর্মচারী হিসেবে কর্মরত হাসান
              ফেরদৌসের নজরে এ চিঠিটি আসে। তিনি ১৯৯৮ সালের ২০ শে জানুয়ারী রফিককে
              অনুরোধ করেন তিনি যেন জাতিসংঘের অন্য কোন সদস্য রাষ্ট্রের কারো কাছ
              থেকে একই ধরনের প্রস্তাব আনার ব্যবস্থা করেন। পরে রফিক, আব্দুস
              সালামকে সাথে নিয়ে “মাদার ল্যাংগুয়েজ লাভার্স অফ দ্যা ওয়ার্ল্ড”
              নামে একটি সংগঠন দাঁড় করান। এতে একজন ইংরেজিভাষী, একজন জার্মানভাষী,
              একজন ক্যান্টোনিভাষী, একজন কাচ্চিভাষী সদস্য ছিলেন। তারা আবারো কফি
              আনানকে “এ গ্রুপ অব মাদার ল্যাংগুয়েজ অফ দ্যা ওয়ার্ল্ড”-এর পক্ষ
              থেকে একটি চিঠি লেখেন, এবং চিঠির একটি কপি ইউএনওর কানাডীয় দূত ডেভিড
              ফাওলারের কাছেও প্রেরণ করা হয়।
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৯৯ সালে তারা জোশেফের সাথে ও পরে ইউনেস্কোর আনা মারিয়ার সাথে দেখা
              করেন, আনা মারিয়া পরামর্শ দেন তাদের প্রস্তাব ৫ টি সদস্য দেশ –
              কানাডা , ভারত, হাঙ্গেরি, ফিনল্যান্ড এবং বাংলাদেশ দ্বারা আনীত হতে
              হবে। তারপর বাংলাদেশের বিভিন্ন প্রস্তাবের পক্ষে সমর্থন দানে ২৯টি
              দেশ অনুরোধ জানাতে কাজ করেন।
            </p>
            <p class="mt-4 text-gray-700">
              ১৯৯৯ খ্রিষ্টাব্দের ১৭ নভেম্বর অনুষ্ঠিত ইউনেস্কোর প্যারিস অধিবেশনে
              প্রস্তাব উত্থাপন করা হয় ও এতে ১৮৮টি দেশ সমর্থন জানালে একুশে
              ফেব্রুয়ারিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করা হয় [৫]
              এবং ২০০০ সালের ২১ ফেব্রুয়ারি থেকে দিবসটি জাতিসংঘের সদস্যদেশসমূহে
              যথাযথ মর্যাদায় পালিত হয়ে আসছে।
            </p>
            <p class="mt-4 text-gray-700">
              চর্চায় যেমন ভাষা গতিশীল থাকে। তেমনই চর্চার অভাবে ভাষা আবার
              মৃত্যুর দিকে ধাবিত হয়। বিশ্বায়নের এই যুগে, মানুষ কর্ম সূত্রে
              ছড়িয়ে পরছে পৃথিবীর এক প্রান্ত থেকে ওপর প্রান্ত, চর্চার অভাবে
              বিলুপ্ত হয়ে যাচ্ছে বিভিন্ন জনগোষ্ঠীর আদি ভাষা। একুশ আমাদের মনে
              করিয়ে দেয় আমাদের ভাষা আমাদের মৌলিক অধিকার, ভাষা আমাদের স্বতন্ত্র
              পরিচায়ক। একুশ আমাদের দেয় ভাষা ভিত্তিক ঔপনিবেশিকতার শেকল ভেঙ্গে
              মাতৃভাষাকে লালন করার চেতনা। এমনি করে একুশ আসুক, একুশ বেঁচে থাকুক
              আমাদের চেতনায়।
            </p>
            <p class="mt-6 text-gray-700">তথ্য সুত্রঃ বাংলাপিডিয়া</p>
          </div>
        </div>
      </div>
    </div>
    <div
      class="relative px-2 bg-gradient-to-r from-amber-50 to-blue-50 bg-img bg-cover bg-center h-96 group pt-8"
    >
      <!-- Overlay for Background Image -->
      <div class="absolute inset-0 bg-gray-900 opacity-85"></div>

      <!-- Tooltip for Image Credit -->
      <div
        class="absolute bottom-2 left-1/2 transform -translate-x-1/2 bg-black text-white text-xs px-2 py-1 rounded opacity-0 group-hover:opacity-100 transition-opacity duration-300"
      >
        Background Image by:
        <a
          class="hover:underline"
          href="https://ca.pinterest.com/pin/2251868554953302/"
          >https://ca.pinterest.com/pin/2251868554953302/</a
        >
        <div
          class="absolute left-1/2 transform -translate-x-1/2 top-full w-0 h-0 border-l-4 border-r-4 border-t-4 border-l-transparent border-r-transparent border-t-black"
        ></div>
      </div>

      <!-- Content Overlay -->
      <div
        class="container md:mx-auto py-6 px-4 space-y-3 lg:px-32 relative z-10"
      >
        <h2
          class="text-4xl md:text-5xl font-bold mb-2 text-white font-cormorant pt-6"
        >
          Join Our Network
        </h2>
        <p class="text-white text-lg text-justify my-2 mb-6">
          Join - Bangali Abhibasi Network: a Glocal Linguo-cultural Association
        </p>
        <button
          @click="join"
          aria-label="Contribute to the community"
          class="text-base px-4 py-3 border-2 border-yellow-500 bg-gradient-to-r from-yellow-500 to-yellow-600 text-white font-semibold rounded-lg lg:hover:bg-gradient-to-r lg:hover:from-gray-50 lg:hover:to-white lg:hover:border-honey-gold lg:hover:border-2 lg:hover:text-honey-gold transition duration-300 ease-in-out"
        >
          Join Our Network
        </button>
      </div>
    </div>
  </div>
</template>

<script>
import CookieConsent from "../../components/CookieConsent.vue";

export default {
  name: "amar-vaiyer-rakte-rangano-ehushe-february",
  components: {
    CookieConsent,
  },

  data() {
    return {};
  },
  methods: {
    join() {
      this.$router.push("/join");
    },
  },
};
</script>

<style scoped>
.img {
  background-image: url("@/assets/img/21feb.jpeg");
  background-size: cover;
  background-position: center;
}
.background-img {
  background-image: url("@/assets/img/211.jpg");
}
.fade-in {
  animation: fadeIn 2s ease-in-out;
}
.bg-img {
  background-image: url("@/assets/img/bg-contribute.png");
}
</style>
